; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=370, out_folder=./training, instance_id=25, seed=2049, goal_proportion=0.03

(define (problem blocksworld-25)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 - object)
 (:init 
    (arm-empty)
    (clear b133)
    (on-table b133)
    (clear b300)
    (on-table b300)
    (clear b155)
    (on-table b155)
    (clear b250)
    (on b250 b94)
    (on b94 b330)
    (on b330 b129)
    (on b129 b23)
    (on b23 b117)
    (on b117 b209)
    (on-table b209)
    (clear b9)
    (on b9 b213)
    (on-table b213)
    (clear b255)
    (on-table b255)
    (clear b142)
    (on-table b142)
    (clear b60)
    (on b60 b361)
    (on b361 b152)
    (on b152 b130)
    (on b130 b156)
    (on b156 b280)
    (on-table b280)
    (clear b217)
    (on-table b217)
    (clear b135)
    (on b135 b136)
    (on b136 b132)
    (on-table b132)
    (clear b234)
    (on b234 b17)
    (on b17 b33)
    (on-table b33)
    (clear b165)
    (on b165 b230)
    (on b230 b226)
    (on b226 b288)
    (on b288 b21)
    (on b21 b54)
    (on-table b54)
    (clear b143)
    (on b143 b241)
    (on-table b241)
    (clear b147)
    (on b147 b93)
    (on b93 b358)
    (on b358 b15)
    (on b15 b74)
    (on b74 b194)
    (on b194 b218)
    (on-table b218)
    (clear b88)
    (on b88 b323)
    (on b323 b26)
    (on b26 b83)
    (on b83 b176)
    (on b176 b50)
    (on b50 b310)
    (on b310 b284)
    (on b284 b44)
    (on b44 b325)
    (on-table b325)
    (clear b267)
    (on b267 b328)
    (on b328 b38)
    (on-table b38)
    (clear b66)
    (on b66 b151)
    (on b151 b316)
    (on b316 b29)
    (on b29 b238)
    (on b238 b77)
    (on b77 b262)
    (on b262 b181)
    (on b181 b360)
    (on b360 b173)
    (on b173 b308)
    (on b308 b61)
    (on b61 b193)
    (on-table b193)
    (clear b204)
    (on b204 b215)
    (on b215 b5)
    (on b5 b161)
    (on b161 b28)
    (on b28 b22)
    (on b22 b182)
    (on b182 b306)
    (on-table b306)
    (clear b232)
    (on-table b232)
    (clear b162)
    (on-table b162)
    (clear b41)
    (on b41 b84)
    (on b84 b354)
    (on b354 b118)
    (on-table b118)
    (clear b214)
    (on b214 b269)
    (on b269 b75)
    (on b75 b290)
    (on b290 b287)
    (on b287 b190)
    (on b190 b126)
    (on b126 b120)
    (on-table b120)
    (clear b338)
    (on-table b338)
    (clear b49)
    (on b49 b237)
    (on b237 b184)
    (on b184 b82)
    (on-table b82)
    (clear b169)
    (on-table b169)
    (clear b113)
    (on b113 b10)
    (on b10 b108)
    (on b108 b85)
    (on b85 b192)
    (on b192 b278)
    (on b278 b335)
    (on b335 b183)
    (on-table b183)
    (clear b357)
    (on-table b357)
    (clear b247)
    (on b247 b301)
    (on-table b301)
    (clear b229)
    (on-table b229)
    (clear b127)
    (on-table b127)
    (clear b111)
    (on b111 b166)
    (on-table b166)
    (clear b304)
    (on b304 b63)
    (on-table b63)
    (clear b121)
    (on b121 b70)
    (on b70 b239)
    (on-table b239)
    (clear b64)
    (on b64 b223)
    (on b223 b362)
    (on b362 b14)
    (on b14 b158)
    (on-table b158)
    (clear b146)
    (on b146 b197)
    (on b197 b53)
    (on b53 b324)
    (on-table b324)
    (clear b76)
    (on b76 b39)
    (on b39 b356)
    (on b356 b339)
    (on b339 b95)
    (on b95 b368)
    (on-table b368)
    (clear b55)
    (on b55 b353)
    (on b353 b244)
    (on b244 b148)
    (on b148 b297)
    (on b297 b228)
    (on b228 b172)
    (on b172 b163)
    (on b163 b25)
    (on b25 b123)
    (on b123 b65)
    (on-table b65)
    (clear b86)
    (on b86 b242)
    (on-table b242)
    (clear b293)
    (on b293 b235)
    (on b235 b48)
    (on b48 b343)
    (on-table b343)
    (clear b32)
    (on b32 b104)
    (on b104 b309)
    (on b309 b138)
    (on b138 b191)
    (on b191 b106)
    (on-table b106)
    (clear b40)
    (on b40 b67)
    (on b67 b170)
    (on-table b170)
    (clear b199)
    (on b199 b107)
    (on-table b107)
    (clear b231)
    (on b231 b206)
    (on b206 b72)
    (on b72 b46)
    (on b46 b322)
    (on b322 b91)
    (on b91 b51)
    (on b51 b114)
    (on b114 b37)
    (on b37 b24)
    (on b24 b167)
    (on b167 b363)
    (on-table b363)
    (clear b149)
    (on b149 b208)
    (on b208 b200)
    (on b200 b261)
    (on b261 b201)
    (on b201 b321)
    (on b321 b89)
    (on b89 b71)
    (on b71 b174)
    (on b174 b246)
    (on b246 b137)
    (on b137 b68)
    (on b68 b285)
    (on b285 b11)
    (on b11 b260)
    (on-table b260)
    (clear b248)
    (on b248 b333)
    (on b333 b81)
    (on b81 b317)
    (on b317 b326)
    (on b326 b202)
    (on b202 b256)
    (on b256 b186)
    (on b186 b216)
    (on b216 b313)
    (on-table b313)
    (clear b249)
    (on b249 b329)
    (on b329 b36)
    (on-table b36)
    (clear b80)
    (on b80 b303)
    (on b303 b103)
    (on-table b103)
    (clear b259)
    (on b259 b177)
    (on b177 b264)
    (on b264 b319)
    (on-table b319)
    (clear b185)
    (on b185 b140)
    (on b140 b220)
    (on b220 b7)
    (on b7 b101)
    (on b101 b340)
    (on-table b340)
    (clear b30)
    (on-table b30)
    (clear b275)
    (on-table b275)
    (clear b178)
    (on b178 b341)
    (on b341 b6)
    (on b6 b157)
    (on b157 b144)
    (on-table b144)
    (clear b175)
    (on b175 b210)
    (on-table b210)
    (clear b225)
    (on-table b225)
    (clear b332)
    (on-table b332)
    (clear b59)
    (on b59 b78)
    (on b78 b2)
    (on b2 b128)
    (on b128 b189)
    (on b189 b236)
    (on-table b236)
    (clear b198)
    (on b198 b34)
    (on b34 b243)
    (on b243 b283)
    (on b283 b296)
    (on-table b296)
    (clear b286)
    (on b286 b109)
    (on-table b109)
    (clear b154)
    (on b154 b359)
    (on b359 b251)
    (on b251 b292)
    (on-table b292)
    (clear b315)
    (on b315 b27)
    (on-table b27)
    (clear b150)
    (on b150 b344)
    (on-table b344)
    (clear b98)
    (on b98 b282)
    (on b282 b320)
    (on b320 b233)
    (on b233 b139)
    (on b139 b273)
    (on b273 b196)
    (on b196 b342)
    (on b342 b318)
    (on b318 b73)
    (on b73 b105)
    (on b105 b57)
    (on b57 b219)
    (on-table b219)
    (clear b365)
    (on b365 b35)
    (on b35 b253)
    (on b253 b245)
    (on b245 b277)
    (on-table b277)
    (clear b257)
    (on-table b257)
    (clear b12)
    (on b12 b349)
    (on b349 b272)
    (on-table b272)
    (clear b187)
    (on-table b187)
    (clear b254)
    (on-table b254)
    (clear b1)
    (on-table b1)
    (clear b291)
    (on-table b291)
    (clear b289)
    (on b289 b299)
    (on b299 b240)
    (on-table b240)
    (clear b180)
    (on b180 b99)
    (on b99 b110)
    (on b110 b369)
    (on-table b369)
    (clear b18)
    (on b18 b336)
    (on b336 b119)
    (on b119 b31)
    (on-table b31)
    (clear b346)
    (on-table b346)
    (clear b270)
    (on b270 b116)
    (on b116 b348)
    (on b348 b265)
    (on-table b265)
    (clear b305)
    (on b305 b347)
    (on b347 b69)
    (on b69 b295)
    (on b295 b90)
    (on b90 b58)
    (on b58 b102)
    (on-table b102)
    (clear b79)
    (on-table b79)
    (clear b125)
    (on b125 b96)
    (on b96 b43)
    (on b43 b141)
    (on-table b141)
    (clear b370)
    (on b370 b168)
    (on b168 b266)
    (on-table b266)
    (clear b311)
    (on b311 b352)
    (on-table b352)
    (clear b327)
    (on b327 b252)
    (on b252 b47)
    (on b47 b258)
    (on b258 b164)
    (on b164 b100)
    (on-table b100)
    (clear b195)
    (on b195 b224)
    (on b224 b366)
    (on b366 b3)
    (on-table b3)
    (clear b20)
    (on b20 b52)
    (on b52 b160)
    (on b160 b281)
    (on b281 b331)
    (on b331 b367)
    (on b367 b364)
    (on b364 b112)
    (on-table b112)
    (clear b122)
    (on b122 b16)
    (on b16 b42)
    (on b42 b337)
    (on-table b337)
    (clear b312)
    (on b312 b203)
    (on-table b203)
    (clear b153)
    (on b153 b134)
    (on b134 b274)
    (on b274 b207)
    (on b207 b97)
    (on-table b97)
    (clear b350)
    (on b350 b45)
    (on b45 b171)
    (on b171 b276)
    (on-table b276)
    (clear b188)
    (on-table b188)
    (clear b334)
    (on-table b334)
    (clear b115)
    (on b115 b4)
    (on b4 b145)
    (on-table b145)
    (clear b19)
    (on b19 b263)
    (on b263 b302)
    (on-table b302)
    (clear b124)
    (on-table b124)
    (clear b13)
    (on-table b13)
    (clear b159)
    (on-table b159)
    (clear b227)
    (on b227 b87)
    (on b87 b355)
    (on-table b355)
    (clear b205)
    (on b205 b92)
    (on-table b92)
    (clear b211)
    (on b211 b345)
    (on b345 b314)
    (on-table b314)
    (clear b271)
    (on b271 b279)
    (on b279 b179)
    (on b179 b221)
    (on b221 b62)
    (on b62 b8)
    (on b8 b307)
    (on b307 b222)
    (on b222 b294)
    (on b294 b212)
    (on b212 b298)
    (on-table b298)
    (clear b351)
    (on b351 b56)
    (on b56 b131)
    (on b131 b268)
    (on-table b268))
 (:goal  (and 
    (clear b5)
    (on-table b5)
    (clear b7)
    (on b7 b11)
    (on b11 b3)
    (on b3 b9)
    (on-table b9)
    (clear b1)
    (on b1 b8)
    (on b8 b10)
    (on b10 b6)
    (on-table b6)
    (clear b2)
    (on b2 b4)
    (on-table b4))))

; plan
1. (unstack b9 b213)
   deleted: (on b9 b213) (clear b9) (arm-empty)
   added: (holding b9) (clear b213)
   goals met: 1 of 15
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 15
3. (unstack b113 b10)
   deleted: (on b113 b10) (clear b113) (arm-empty)
   added: (holding b113) (clear b10)
   goals met: 2 of 15
4. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 2 of 15
5. (unstack b115 b4)
   deleted: (on b115 b4) (clear b115) (arm-empty)
   added: (holding b115) (clear b4)
   goals met: 2 of 15
6. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 2 of 15
7. (unstack b4 b145)
   deleted: (on b4 b145) (clear b4) (arm-empty)
   added: (holding b4) (clear b145)
   goals met: 2 of 15
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 15
9. (unstack b149 b208)
   deleted: (on b149 b208) (clear b149) (arm-empty)
   added: (holding b149) (clear b208)
   goals met: 3 of 15
10. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 3 of 15
11. (unstack b178 b341)
   deleted: (on b178 b341) (clear b178) (arm-empty)
   added: (holding b178) (clear b341)
   goals met: 3 of 15
12. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 3 of 15
13. (unstack b185 b140)
   deleted: (on b185 b140) (clear b185) (arm-empty)
   added: (holding b185) (clear b140)
   goals met: 3 of 15
14. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 3 of 15
15. (unstack b140 b220)
   deleted: (on b140 b220) (clear b140) (arm-empty)
   added: (holding b140) (clear b220)
   goals met: 3 of 15
16. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 3 of 15
17. (unstack b195 b224)
   deleted: (on b195 b224) (clear b195) (arm-empty)
   added: (holding b195) (clear b224)
   goals met: 3 of 15
18. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 3 of 15
19. (unstack b204 b215)
   deleted: (on b204 b215) (clear b204) (arm-empty)
   added: (holding b204) (clear b215)
   goals met: 3 of 15
20. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 3 of 15
21. (unstack b208 b200)
   deleted: (on b208 b200) (clear b208) (arm-empty)
   added: (holding b208) (clear b200)
   goals met: 3 of 15
22. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 3 of 15
23. (unstack b200 b261)
   deleted: (on b200 b261) (clear b200) (arm-empty)
   added: (holding b200) (clear b261)
   goals met: 3 of 15
24. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 3 of 15
25. (unstack b215 b5)
   deleted: (on b215 b5) (clear b215) (arm-empty)
   added: (holding b215) (clear b5)
   goals met: 4 of 15
26. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 4 of 15
27. (unstack b5 b161)
   deleted: (on b5 b161) (clear b5) (arm-empty)
   added: (holding b5) (clear b161)
   goals met: 3 of 15
28. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 15
29. (unstack b220 b7)
   deleted: (on b220 b7) (clear b220) (arm-empty)
   added: (holding b220) (clear b7)
   goals met: 6 of 15
30. (putdown b220)
   deleted: (holding b220)
   added: (clear b220) (arm-empty) (on-table b220)
   goals met: 6 of 15
31. (unstack b224 b366)
   deleted: (on b224 b366) (clear b224) (arm-empty)
   added: (holding b224) (clear b366)
   goals met: 6 of 15
32. (putdown b224)
   deleted: (holding b224)
   added: (clear b224) (arm-empty) (on-table b224)
   goals met: 6 of 15
33. (unstack b261 b201)
   deleted: (on b261 b201) (clear b261) (arm-empty)
   added: (holding b261) (clear b201)
   goals met: 6 of 15
34. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 6 of 15
35. (unstack b201 b321)
   deleted: (on b201 b321) (clear b201) (arm-empty)
   added: (holding b201) (clear b321)
   goals met: 6 of 15
36. (putdown b201)
   deleted: (holding b201)
   added: (clear b201) (arm-empty) (on-table b201)
   goals met: 6 of 15
37. (unstack b271 b279)
   deleted: (on b271 b279) (clear b271) (arm-empty)
   added: (holding b271) (clear b279)
   goals met: 6 of 15
38. (putdown b271)
   deleted: (holding b271)
   added: (clear b271) (arm-empty) (on-table b271)
   goals met: 6 of 15
39. (unstack b279 b179)
   deleted: (on b279 b179) (clear b279) (arm-empty)
   added: (holding b279) (clear b179)
   goals met: 6 of 15
40. (putdown b279)
   deleted: (holding b279)
   added: (clear b279) (arm-empty) (on-table b279)
   goals met: 6 of 15
41. (unstack b179 b221)
   deleted: (on b179 b221) (clear b179) (arm-empty)
   added: (holding b179) (clear b221)
   goals met: 6 of 15
42. (putdown b179)
   deleted: (holding b179)
   added: (clear b179) (arm-empty) (on-table b179)
   goals met: 6 of 15
43. (unstack b221 b62)
   deleted: (on b221 b62) (clear b221) (arm-empty)
   added: (holding b221) (clear b62)
   goals met: 6 of 15
44. (putdown b221)
   deleted: (holding b221)
   added: (clear b221) (arm-empty) (on-table b221)
   goals met: 6 of 15
45. (unstack b321 b89)
   deleted: (on b321 b89) (clear b321) (arm-empty)
   added: (holding b321) (clear b89)
   goals met: 6 of 15
46. (putdown b321)
   deleted: (holding b321)
   added: (clear b321) (arm-empty) (on-table b321)
   goals met: 6 of 15
47. (unstack b341 b6)
   deleted: (on b341 b6) (clear b341) (arm-empty)
   added: (holding b341) (clear b6)
   goals met: 6 of 15
48. (putdown b341)
   deleted: (holding b341)
   added: (clear b341) (arm-empty) (on-table b341)
   goals met: 6 of 15
49. (unstack b6 b157)
   deleted: (on b6 b157) (clear b6) (arm-empty)
   added: (holding b6) (clear b157)
   goals met: 6 of 15
50. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 15
51. (unstack b366 b3)
   deleted: (on b366 b3) (clear b366) (arm-empty)
   added: (holding b366) (clear b3)
   goals met: 7 of 15
52. (putdown b366)
   deleted: (holding b366)
   added: (clear b366) (arm-empty) (on-table b366)
   goals met: 7 of 15
53. (unstack b59 b78)
   deleted: (on b59 b78) (clear b59) (arm-empty)
   added: (holding b59) (clear b78)
   goals met: 7 of 15
54. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 7 of 15
55. (unstack b62 b8)
   deleted: (on b62 b8) (clear b62) (arm-empty)
   added: (holding b62) (clear b8)
   goals met: 7 of 15
56. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 7 of 15
57. (unstack b78 b2)
   deleted: (on b78 b2) (clear b78) (arm-empty)
   added: (holding b78) (clear b2)
   goals met: 8 of 15
58. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 8 of 15
59. (unstack b89 b71)
   deleted: (on b89 b71) (clear b89) (arm-empty)
   added: (holding b89) (clear b71)
   goals met: 8 of 15
60. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 8 of 15
61. (unstack b71 b174)
   deleted: (on b71 b174) (clear b71) (arm-empty)
   added: (holding b71) (clear b174)
   goals met: 8 of 15
62. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 8 of 15
63. (unstack b174 b246)
   deleted: (on b174 b246) (clear b174) (arm-empty)
   added: (holding b174) (clear b246)
   goals met: 8 of 15
64. (putdown b174)
   deleted: (holding b174)
   added: (clear b174) (arm-empty) (on-table b174)
   goals met: 8 of 15
65. (unstack b246 b137)
   deleted: (on b246 b137) (clear b246) (arm-empty)
   added: (holding b246) (clear b137)
   goals met: 8 of 15
66. (putdown b246)
   deleted: (holding b246)
   added: (clear b246) (arm-empty) (on-table b246)
   goals met: 8 of 15
67. (unstack b137 b68)
   deleted: (on b137 b68) (clear b137) (arm-empty)
   added: (holding b137) (clear b68)
   goals met: 8 of 15
68. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 8 of 15
69. (unstack b68 b285)
   deleted: (on b68 b285) (clear b68) (arm-empty)
   added: (holding b68) (clear b285)
   goals met: 8 of 15
70. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 8 of 15
71. (unstack b285 b11)
   deleted: (on b285 b11) (clear b285) (arm-empty)
   added: (holding b285) (clear b11)
   goals met: 8 of 15
72. (putdown b285)
   deleted: (holding b285)
   added: (clear b285) (arm-empty) (on-table b285)
   goals met: 8 of 15
73. (unstack b10 b108)
   deleted: (on b10 b108) (clear b10) (arm-empty)
   added: (holding b10) (clear b108)
   goals met: 8 of 15
74. (stack b10 b6)
   deleted: (clear b6) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b6)
   goals met: 9 of 15
75. (unstack b11 b260)
   deleted: (on b11 b260) (clear b11) (arm-empty)
   added: (holding b11) (clear b260)
   goals met: 9 of 15
76. (stack b11 b3)
   deleted: (clear b3) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b3)
   goals met: 10 of 15
77. (unstack b8 b307)
   deleted: (on b8 b307) (clear b8) (arm-empty)
   added: (holding b8) (clear b307)
   goals met: 10 of 15
78. (stack b8 b10)
   deleted: (clear b10) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b10)
   goals met: 11 of 15
79. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 10 of 15
80. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 12 of 15
81. (unstack b2 b128)
   deleted: (on b2 b128) (clear b2) (arm-empty)
   added: (holding b2) (clear b128)
   goals met: 11 of 15
82. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 13 of 15
83. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 12 of 15
84. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 12 of 15
85. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 12 of 15
86. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 13 of 15
87. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 13 of 15
88. (stack b11 b3)
   deleted: (clear b3) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b3)
   goals met: 14 of 15
89. (unstack b7 b101)
   deleted: (on b7 b101) (clear b7) (arm-empty)
   added: (holding b7) (clear b101)
   goals met: 13 of 15
90. (stack b7 b11)
   deleted: (clear b11) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b11)
   goals met: 15 of 15
